# Taps
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Packages
brew "ag"
brew "aws-iam-authenticator"
brew "awscli"
brew "azure-cli"
brew "direnv"
brew "gnupg"
brew "go"
brew "graphviz"
brew "grpcurl"
brew "htop"
brew "jq"
brew "kube-ps1"
brew "kubectx"
brew "kubernetes-cli"
brew "kubetail"
brew "kustomize"
brew "midnight-commander"
brew "moreutils"
brew "ngrep"
brew "packer"
brew "prettier"
brew "pstree"
brew "ripgrep"
brew "ripgrep"
brew "shellcheck"
brew "stow"
brew "tfenv"
brew "tflint"
brew "the_silver_searcher"
brew "tig"
brew "tree"
brew "watch"
brew "wget"
brew "wireshark"
brew "youtube-dl"
brew "yq"
cask "alt-tab"
cask "aws-vault"
cask "dash"
cask "docker"
cask "flux"
cask "google-cloud-sdk"
cask "joplin"
cask "karabiner-elements"
cask "keepassxc"
cask "slack"
cask "spotify"
cask "visual-studio-code"

# App Store
brew "mas"

mas "Amphetamine", id: 937984704
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835
